In [4]:
import sklearn

In [3]:
import pandas as pd

In [2]:
from matplotlib import pyplot as plt

In [5]:
df= pd.read_csv("nasdaq100.csv", sep=';')
df.head()

       Date  Starting (USD)  Ending (USD)
0  01.01.24           16800         16500
1  01.12.23           15900         16100
2  01.11.23           15800         15300
3  01.10.23           16100         16200
4  01.09.23           16300         15700

In [5]:
df=df.drop(columns=['Date'])
df.head()

   Starting (USD)  Ending (USD)
0           16800         16500
1           15900         16100
2           15800         15300
3           16100         16200
4           16300         15700

In [6]:
from sklearn.linear_model import LinearRegression
reg=LinearRegression()